org/blog/2021/question-2021-4.org
#+SETUPFILE: ~/repo/blog/tpl/nil-site-tpl.org
#+TITLE: 2021 年第 4 周问题汇总

2021-01-25 ~ 2021-01-31

** 2021-01-25
   :PROPERTIES:
   :CUSTOM_ID: section
   :END:

- 为什么博客需要刷新一下才能显示样式，第一次进入某个页面时，发现样式全部丢失了？是不是因为
  [[https://github.com/tianheg/blog/compare/1bed2bcf1a4270fcf4f9382b0d4151d14e9ebac1...main][昨天编辑了 Hugo 语法高亮 短代码的缘故]]？我想我可以把 「这段 CSS 代码」
  移到下面。另一种原因：Chrome 扩展影响 CSS 的正常加载。
- 什么是“元认知”、"元学科"？为什么「网络科学、认知&神经&心理科学、编程、数学与诗歌」是二十一世纪最重要的五大「元学科」？[[https://www.yangzhiping.com/psy/openmintalk.html][参考]]
- 怎样才能删除 Hugo 的 markdown 语法里的 任务列表前的 =黑点= 呢？
- 为什么网站提供邮箱时，要把 @ 改成 #
  或其他字符，使得邮箱不可以直接点击？一种原因：防止机器人收集邮箱，发送垃圾邮件
- 为什么在我的博客内容页，内容可以在屏幕变小时自动缩进，链接却不能，进而使链接长度超过屏幕宽度呢？
- 为什么我总是觉得自己正在做一件过去做过的事情呢？有时候觉得自己已经做过很多次这样的事情了。
- 为什么 Trello 中的
  [[https://trello.com/power-ups/5e14aa34ce4580518945bf9b/text-to-cards][Power-Up:
  Text to Cards]] 无法使用呢？我主要想让 Trello
  的标签名字显示出来，答案是：只要点击标签就能让标签显示
- 什么是亲情？维系人类族系关系的究竟是什么？
- 为什么计算机科学教育不能使任何人成为专业的程序员？（Computer science
  education cannot make anybody an expert programmer any more than
  studying brushes and pigment can make somebody an expert painter.-
  Eric Raymond）

** 2021-01-31
   :PROPERTIES:
   :CUSTOM_ID: section-1
   :END:

- fujiu（一种发酵的米饭）是怎么做的呢？
