blog/2021/question-2021-4.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-06 Sun 19:00 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>2021 年第 4 周问题汇总</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">2021 年第 4 周问题汇总</h1>
</header><p>
2021-01-25 ~ 2021-01-31
</p>

<div id="outline-container-section" class="outline-2">
<h2 id="section">2021-01-25</h2>
<div class="outline-text-2" id="text-section">
<ul class="org-ul">
<li>为什么博客需要刷新一下才能显示样式，第一次进入某个页面时，发现样式全部丢失了？是不是因为
<a href="https://github.com/tianheg/blog/compare/1bed2bcf1a4270fcf4f9382b0d4151d14e9ebac1...main">昨天编辑了 Hugo 语法高亮 短代码的缘故</a>？我想我可以把 「这段 CSS 代码」
移到下面。另一种原因：Chrome 扩展影响 CSS 的正常加载。</li>
<li>什么是“元认知”、"元学科"？为什么「网络科学、认知&amp;神经&amp;心理科学、编程、数学与诗歌」是二十一世纪最重要的五大「元学科」？<a href="https://www.yangzhiping.com/psy/openmintalk.html">参考</a></li>
<li>怎样才能删除 Hugo 的 markdown 语法里的 任务列表前的 <code>黑点</code> 呢？</li>
<li>为什么网站提供邮箱时，要把 @ 改成 #
或其他字符，使得邮箱不可以直接点击？一种原因：防止机器人收集邮箱，发送垃圾邮件</li>
<li>为什么在我的博客内容页，内容可以在屏幕变小时自动缩进，链接却不能，进而使链接长度超过屏幕宽度呢？</li>
<li>为什么我总是觉得自己正在做一件过去做过的事情呢？有时候觉得自己已经做过很多次这样的事情了。</li>
<li>为什么 Trello 中的
<a href="https://trello.com/power-ups/5e14aa34ce4580518945bf9b/text-to-cards">Power-Up:
Text to Cards</a> 无法使用呢？我主要想让 Trello
的标签名字显示出来，答案是：只要点击标签就能让标签显示</li>
<li>什么是亲情？维系人类族系关系的究竟是什么？</li>
<li>为什么计算机科学教育不能使任何人成为专业的程序员？（Computer science
education cannot make anybody an expert programmer any more than
studying brushes and pigment can make somebody an expert painter.-
Eric Raymond）</li>
</ul>
</div>
</div>

<div id="outline-container-section-1" class="outline-2">
<h2 id="section-1">2021-01-31</h2>
<div class="outline-text-2" id="text-section-1">
<ul class="org-ul">
<li>fujiu（一种发酵的米饭）是怎么做的呢？</li>
</ul>
</div>
</div>
</div>
</body>
</html>